In [4]:
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import seaborn as sns
from matplotlib import pyplot as plt
%matplotlib inline
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [8]:
card = pd.read_excel('tj_01_creditcard_card.xlsx')
customer = pd.read_excel('tj_01_creditcard_customer.xlsx')

training = pd.read_excel('tj_01_training.xlsx')
test = pd.read_excel('tj_01_test.xlsx')

card.head()
customer.head()
training.head()
test.head()

,card_no,bill_cyc,pos_dt,cst_id,open_dt,exp_dt,cr_lmt_amt,prev_cr_lmt_amt
0,1234000000023349,20,2017-02-23,1000004674,2010-12-20,1220,70000,0
1,1234000000007292,17,2017-02-23,1000010084,2014-06-04,619,69000,60000
2,1234000000018889,20,2017-02-23,1000009114,2014-01-22,119,27000,32000
3,1234000000016887,17,2017-02-23,1000013313,2015-12-03,1220,41000,0
4,1234000000026997,17,2017-02-23,1000010235,2014-06-24,619,50000,60000

       cst_id  incm_amt   age  main_zip_cd  cr_line_amt     pos_dt
0  1000001115     47676  41.0        11110       100000 2017-02-23
1  1000004693     27157  52.0        10170        80000 2017-02-23
2  1000008370     20990  27.0        10900        52000 2017-02-23
3  1000004738     21879  33.0        10150        40000 2017-02-23
4  1000000044     71361  62.0        50100       178000 2017-02-23

   1234000000017866  0
0  1234000000023670  1
1  1234000000012719  0
2  1234000000021503  0
3  1234000000010310  0
4  1234000000025726  0

   1234000000018444
0  1234000000014024
1  1234000000018965
2  1234000000012493
3  1234000000026521
4  1234000000004911